# GetBoundary Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSpace..::..GetBoundary Method
EnergyAnalysisSpace Class See Also
---
Gets the collection of polygons that form the 2D boundary. This method returns a collection of polyloops (planar polygons) that defines an enclosed area measured by interior bounding surfaces.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<Polyloop> GetBoundary()
```

Visual Basic
---
```text
Public Function GetBoundary As IList(Of Polyloop)
```

Visual C++
---
```text
public:
IList<Polyloop^>^ GetBoundary()
```

# ### Return Value
The collection of polygons that form the 2D boundary.
# See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace